<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Installs Linphone</string>
    <key>Identifier</key>
    <string>com.github.roock.munki.linphone</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Linphone</string>
        <key>URL</key>
        <string>http://www.linphone.org/downloads-for-desktop.html</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Linphone</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Linphone - A SoftPhone</string>
            <key>display_name</key>
            <string>Linphone</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.roock.download.linphone</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Import the pkg into Munki!</string>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
