<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Linphone 3.8</string>
    <key>Identifier</key>
    <string>com.github.roock.download.linphone</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Linphone</string>
        <key>MAJOR_OS_VERSION</key>
        <string>Mavericks</string>
        <key>SEARCH_URL</key>
        <string>http://www.linphone.org/downloads-for-desktop.html</string>
        <key>SEARCH_PATTERN</key>
        <string>linphone-(?P&lt;version&gt;[0-9.]+)\.pkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://download-mirror.savannah.gnu.org/releases/linphone/3.8.x/macos/linphone-%version%.pkg</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
